Return-Path: <linux-media+bounces-15827-lists+linux-media=lfdr.de@vger.kernel.org>
X-Original-To: lists+linux-media@lfdr.de
Delivered-To: lists+linux-media@lfdr.de
Received: from am.mirrors.kernel.org (am.mirrors.kernel.org [IPv6:2604:1380:4601:e00::3])
	by mail.lfdr.de (Postfix) with ESMTPS id 48F19948B08
	for <lists+linux-media@lfdr.de>; Tue,  6 Aug 2024 10:17:13 +0200 (CEST)
Received: from smtp.subspace.kernel.org (wormhole.subspace.kernel.org [52.25.139.140])
	(using TLSv1.2 with cipher ECDHE-RSA-AES256-GCM-SHA384 (256/256 bits))
	(No client certificate requested)
	by am.mirrors.kernel.org (Postfix) with ESMTPS id 9B23F1F21C86
	for <lists+linux-media@lfdr.de>; Tue,  6 Aug 2024 08:17:12 +0000 (UTC)
Received: from localhost.localdomain (localhost.localdomain [127.0.0.1])
	by smtp.subspace.kernel.org (Postfix) with ESMTP id 744A3166F36;
	Tue,  6 Aug 2024 08:17:06 +0000 (UTC)
X-Original-To: linux-media@vger.kernel.org
Received: from smtp.kernel.org (aws-us-west-2-korg-mail-1.web.codeaurora.org [10.30.226.201])
	(using TLSv1.2 with cipher ECDHE-RSA-AES256-GCM-SHA384 (256/256 bits))
	(No client certificate requested)
	by smtp.subspace.kernel.org (Postfix) with ESMTPS id 1DDEF5464E
	for <linux-media@vger.kernel.org>; Tue,  6 Aug 2024 08:17:06 +0000 (UTC)
Authentication-Results: smtp.subspace.kernel.org; arc=none smtp.client-ip=10.30.226.201
ARC-Seal:i=1; a=rsa-sha256; d=subspace.kernel.org; s=arc-20240116;

>>>>> + *			(struct rkisp1_ext_params_bls_config *)block;
>>>>> + *
>>>>> + *		bls->header.type = RKISP1_EXT_PARAMS_BLOCK_ID_BLS;
>>>>> + *		bls->header.enable = RKISP1_EXT_PARAMS_BLOCK_ENABLE;
>>>>> + *		bls->header.size = sizeof(*bls);
>>>>> + *
>>>>> + *		bls->config.enable_auto = 0;
>>>>> + *		bls->config.fixed_val.r = blackLevelRed_;
>>>>> + *		bls->config.fixed_val.gr = blackLevelGreenR_;
>>>>> + *		bls->config.fixed_val.gb = blackLevelGreenB_;
>>>>> + *		bls->config.fixed_val.b = blackLevelBlue_;
>>>>> + *	}
>>>>> + *
>>>>> + * @type: The parameters block type, see
>>>>> + *	  :c:type:`rkisp1_ext_params_block_type`
>>>>> + * @enable: The block enable flag, see
>>>>> + *	   :c:type:`rkisp1_ext_params_block_enable`
>>>>> + * @size: Size (in bytes) of the parameters block, including this header
>>>>> + */
>>>>> +struct rkisp1_ext_params_block_header {
>>>>> +	__u16 type;
>>>>> +	__u16 enable;
>>>>> +	__u16 size;
>>>>
>>>> I would suggest changing this to '__u32 size;'. It ensures the header is8 bytes
>>>> long (much nicer than 6), and if there is ever a block > 65535, then it is supported.
>>>
>>> I'm pretty confident we will never need a block size larger than 64kB.
>>
>> Hmm, famous last words :-)
>>
>>> That would mean more than 64kB of data written to hardware
>>> registers/SRAM for a single processing block, and it would be incredibly
>>> expensive in terms of hardware. Keeping size a __u16 means we have two
>>> bytes of reserved space we could possibly use later, which may come
>>> handy.
>>
>> i would prefer to change the size to a u32, but rename the 'enable' field
>> to 'flags', and assign bit 0 to the enable/disable bit. This is a bit
>> more flexible IMHO and allows for 15 bits to encode additional data.
>>
>>  Blocks > 64kB could still be supported in the future by defining
>>> a new version of the parameters format (RKISP1_EXT_PARAM_BUFFER_V2)
>>> without needing a different 4CC.
>>>
>>> This being said, the opposite argument can be made, that a 32-bit size
>>> could come handy if we ever have larger blocks, and a new version of the
>>> parameters format could be used if we ever need to add more fields to
>>> the block header. I won't insist either way.
>>>
>>>> i wonder if, with this change, the 'aligned(8)' attributes are even needed, but
>>>> I didn't dig into that.
>>>
>>> The header would become 8-bytes long, but its larger field would still
>>> be 4-bytes long, so the compiler would only enforce 4-bytes aligned
>>> AFAIK.
>>
>> Normally the actual data blocks (in the non-extensible format) are already aligned
>> to either 4 or 8 bytes (depending on whether u64 values are used). So an 8 byte
>> header won't mess up the alignment.
> 
> When it come to existing uAPI types (non-extensible) they sometimes
> have holes and are aligned by the compiler to the size of the
> largest-member, even when embedded in other structure. In example,
> cproc is 7 bytes in size
> 
> struct rkisp1_cif_isp_cproc_config {
> 	__u8                       c_out_range;          /*     0     1 */
> 	__u8                       y_in_range;           /*     1     1 */
> 	__u8                       y_out_range;          /*     2     1 */
> 	__u8                       contrast;             /*     3     1 */
> 	__u8                       brightness;           /*     4     1 */
> 	__u8                       sat;                  /*     5     1 */
> 	__u8                       hue;                  /*     6     1 */
> 
> 	/* size: 7, cachelines: 1, members: 7 */
> 	/* last cacheline: 7 bytes */
> };
> 
> And when embedded in the corresponding extensible type it gets aligned
> to the size of the largest member in the structure (4 bytes)
> regardless if __attribute__((aligned(8)) is specified or not (by
> chance, in this case we get a size which is 8-bytes aligned)
> 
> struct rkisp1_ext_params_cproc_config {
> 	struct rkisp1_ext_params_block_header header;    /*     0     8 */
> 	struct rkisp1_cif_isp_cproc_config config;       /*     8     7 */
> 
> 	/* size: 16, cachelines: 1, members: 2 */
> 	/* padding: 1 */
> 	/* last cacheline: 16 bytes */
> };

A potential problem with padding in a public data structure is that you
have to be careful that no memory is leaked in the padding data from the
kernel to userspace.

Another potential problem is if e.g. rkisp1_cif_isp_cproc_config is extended
with a new byte in the future: in that case the new byte would replace the current
padding byte, but applications using the older struct may have left the
padding byte undefined, so the driver can't rely on that byte being 0
when called from such an application.

For compound control (which have similar problems) I have quite strict
requirements: the structure layout may not contain any holes, and I require (and
test) that any reserved/padding fields at set to 0 by the driver and that it is
documented that userspace sets it to 0 as well.

My recommendation for public APIs that effectively return data structures
is to:

1) ensure the layout is the same for 32 and 64 bit code,
2) there are no holes, instead use reserved[] arrays instead,
3) ensure that reserved fields are always set to 0 by the driver,
   and document that userspace sets it to 0 as well. You could chose
   to test for that and fail if it is not 0.

> 
> Other structures are instead aligned to 4 bytes boundary without the
> aligned(8) attribute specified, in example BLS:
> 
> struct rkisp1_ext_params_bls_config {
> 	struct rkisp1_ext_params_block_header header;    /*     0     8 */
> 	struct rkisp1_cif_isp_bls_config config;         /*     8    28 */
> 
> 	/* XXX last struct has 1 hole */
> 
> 	/* size: 36, cachelines: 1, members: 2 */
> 	/* member types with holes: 1, total: 1 */
> 	/* last cacheline: 36 bytes */
> };
> 
> Which is not 8 bytes aligned, compared to the 40 bytes long aligned(8)
> version here below:
> 
> struct rkisp1_ext_params_bls_config {
> 	struct rkisp1_ext_params_block_header header;    /*     0     8 */
> 	struct rkisp1_cif_isp_bls_config config;         /*     8    28 */
> 
> 	/* XXX last struct has 1 hole */
> 
> 	/* size: 40, cachelines: 1, members: 2 */
> 	/* padding: 4 */
> 	/* member types with holes: 1, total: 1 */
> 	/* last cacheline: 40 bytes */
> } __attribute__((__aligned__(8)));
> 
> Now, the question is if we want 8 bytes alignment for all structures
> or not.
> 
> 8-bytes alignment is significant when trying to read an 8-byte data
> type from a non-8-bytes-aligned address but as far as I can tell there
> are no u64 fields in the uAPI and the compiler would have aligned
> them anyway, so this is not a concern.
> 
> When it comes to 32-bit compatibility (32 bits userspace running on a
> 64 bits kernel) I don't see any pointer in the uAPI whose size can
> change between a 32-bit and a 64-bit system, and all types have their
> size specified, so I don't think we would have any issue there.

If there are no u64/s64 fields and no pointers, and you don't expect
